docs/math/real-numbers.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-04-11 Sun 12:09 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Real Numbers</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Alex Nelson">
<link rel="preconnect" href="https://fonts.gstatic.com"><link href="https://fonts.googleapis.com/css2?family=Spectral&display=swap" rel="stylesheet">
<link href="https://fonts.googleapis.com/css2?family=Merriweather" rel="stylesheet">
<div style="display: none"> \(
\newcommand\D{\mathrm{d}}
\newcommand\E{\mathrm{e}}
\newcommand\I{\mathrm{i}}
\newcommand\bigOh{\mathcal{O}}
\newcommand{\cat}[1]{\mathbf{#1}}
\newcommand\curl{\vec{\nabla}\times}
\newcommand{\CC}{\mathbb{C}}
\newcommand{\NN}{\mathbb{N}}
\newcommand{\QQ}{\mathbb{Q}}
\newcommand{\RR}{\mathbb{R}}
\newcommand{\ZZ}{\mathbb{Z}}
\)</div>
<link rel="stylesheet" type="text/css" href="../css/stylesheet.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content">
<h1 class="title">Real Numbers</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#h-1a0e3ff4-f83e-4637-ad16-b848fcb32889">1. Number Systems</a>
<ul>
<li><a href="#h-3a91fd92-2fce-4fc9-9fc3-56229d9a3726">1.1. Natural Numbers</a>
<ul>
<li><a href="#h-b0bf181e-49a5-40e3-bfc0-b1b710be5791">1.1.1. Peano Arithmetic</a></li>
<li><a href="#h-b5d8cdcb-8c2b-4219-a090-9e5d5c9c2174">1.1.2. Axioms</a></li>
</ul>
</li>
<li><a href="#h-377d11f6-9421-4224-bb23-65bfe678316f">1.2. Integers</a></li>
<li><a href="#h-95b8e0bc-d3f5-4e9e-9789-f168e8e54ea2">1.3. Rational Numbers</a></li>
<li><a href="#h-fff97fc0-1878-49ee-9040-36ab02b2f9a3">1.4. Real Numbers</a>
<ul>
<li><a href="#h-69e02083-6b6c-4e65-a429-3ac76ee71a8d">1.4.1. Axioms</a></li>
</ul>
</li>
<li><a href="#h-4fed6c46-045e-47d5-a733-af8ad46ca34e">1.5. Transcendental and Algebraic Numbers</a></li>
<li><a href="#h-842c7308-3999-4bb3-9c26-f77e07103242">1.6. Definable Real Numbers</a></li>
</ul>
</li>
<li><a href="#h-388452a6-a114-401d-b69d-8f42e86dba55">2. Scientific Notation</a>
<ul>
<li><a href="#h-1cc9f972-bff9-490f-b31b-3c66c9cdf012">2.1. Binary</a></li>
</ul>
</li>
<li><a href="#h-fbae1e82-b1d1-46f5-8e08-4d1d6f7774d2">3. References</a></li>
</ul>
</div>
</div>

<div id="outline-container-h-1a0e3ff4-f83e-4637-ad16-b848fcb32889" class="outline-2">
<h2 id="h-1a0e3ff4-f83e-4637-ad16-b848fcb32889"><span class="section-number-2">1</span> Number Systems</h2>
<div class="outline-text-2" id="text-h-1a0e3ff4-f83e-4637-ad16-b848fcb32889">
<p>
The real numbers are typically taught as the final "target" in a
sequence of number systems.
</p>
</div>

<div id="outline-container-h-3a91fd92-2fce-4fc9-9fc3-56229d9a3726" class="outline-3">
<h3 id="h-3a91fd92-2fce-4fc9-9fc3-56229d9a3726"><span class="section-number-3">1.1</span> Natural Numbers</h3>
<div class="outline-text-3" id="text-h-3a91fd92-2fce-4fc9-9fc3-56229d9a3726">
<p>
We can begin with the natural numbers.
</p>
</div>

<div id="outline-container-h-b0bf181e-49a5-40e3-bfc0-b1b710be5791" class="outline-4">
<h4 id="h-b0bf181e-49a5-40e3-bfc0-b1b710be5791"><span class="section-number-4">1.1.1</span> Peano Arithmetic</h4>
<div class="outline-text-4" id="text-h-b0bf181e-49a5-40e3-bfc0-b1b710be5791">
<p>
An axiomatic way to do so is assert there is some constant <code>Z</code>
that's a natural number, and if <code>x</code> is a natural number then we can
apply a function/constructor of a single argument <code>S</code> to it to get
<code>S x</code> another distinct natural number. By iteratively applying <code>S</code>
to <code>Z</code>, we get all the natural numbers.
</p>

<p>
We identify <code>Z</code> with zero, <code>S Z</code> with one, <code>S (S Z)</code> with two, and
so on. Further, <code>S</code> is injective as a mapping of the natural
numbers to itself&#x2026;so for any <code>m</code> and <code>n</code>, we have <code>m=n</code> if and
only if <code>S m = S n</code>.
</p>

<p>
These are the Peano Axioms. We could define the familiar binary
operators like addition, which satisfies the properties:
</p>

<ul class="org-ul">
<li><code>a + Z = a</code></li>
<li><code>a + (S b) = (S a) + b</code></li>
</ul>

<p>
Multiplication could similarly be defined inductively:
</p>

<ul class="org-ul">
<li><code>a * Z = Z</code></li>
<li><code>a * (S b) = a + a*b</code></li>
</ul>
</div>
</div>

<div id="outline-container-h-b5d8cdcb-8c2b-4219-a090-9e5d5c9c2174" class="outline-4">
<h4 id="h-b5d8cdcb-8c2b-4219-a090-9e5d5c9c2174"><span class="section-number-4">1.1.2</span> Axioms</h4>
<div class="outline-text-4" id="text-h-b5d8cdcb-8c2b-4219-a090-9e5d5c9c2174">
<p>
We "know" arithmetic, but what axioms do we "need"? The ones we
should hope for include, but are not limited to:
</p>

<ul class="org-ul">
<li>Closure under addition and multiplication, i.e., \(a\times b\) is a
natural number, and \(a + b\) is another natural number.</li>
<li>Addition
<dl class="org-dl">
<dt>Associativity</dt><dd>\(a + (b + c) = (a + b) + c\)</dd>
<dt>Commutativity</dt><dd>\(a + b = b + a\)</dd>
<dt>Identity Element</dt><dd>\(0 + a = a\)</dd>
</dl></li>
<li>Multiplication
<dl class="org-dl">
<dt>Associativity</dt><dd>\(a\times(b\times c)=(a\times b)\times c\)</dd>
<dt>Commutativity</dt><dd>\(a\times b = b\times a\)</dd>
<dt>Identity Element</dt><dd>\(a\times 1 = a\)</dd>
<dt>Distributivity</dt><dd>\(a\times(b + c) = a\times b + a\times c\)</dd>
<dt>No nonzero zero divisors</dt><dd>if \(a\times b = 0\), then either \(a = 0\)
or \(b = 0\)</dd>
</dl></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-h-377d11f6-9421-4224-bb23-65bfe678316f" class="outline-3">
<h3 id="h-377d11f6-9421-4224-bb23-65bfe678316f"><span class="section-number-3">1.2</span> Integers</h3>
<div class="outline-text-3" id="text-h-377d11f6-9421-4224-bb23-65bfe678316f">
<p>
We allow subtraction to natural numbers. Subtraction is a binary
operation, written \(a - b\) for integers \(a\) and \(b\), which is such
that \((a - b) + b = a\). We generically write \(0 - a\) as \(-a\), and
refer to it as the <dfn>negation</dfn> of \(a\).
</p>

<p>
If we wanted to be rigorous, we could use the Grothendieck
construction: work with pairs of natural numbers \((a,b)\) and
instead of equality, we use an equalivalence relation
</p>

\begin{equation}
(a,b) \sim (x, y)\iff a+y = b+x.
\end{equation}

<p>
If \(a > b\), then \((a,b)\) is intuitively the equivalence class
corresponding to the number \(a - b > 0\). On the other hand, for \(a
< b\), the pair corresponds to the equivalence class of the negative
number \(a - b\). We should think of the first component as a
surplus, the second as a deficit.
</p>
</div>
</div>

<div id="outline-container-h-95b8e0bc-d3f5-4e9e-9789-f168e8e54ea2" class="outline-3">
<h3 id="h-95b8e0bc-d3f5-4e9e-9789-f168e8e54ea2"><span class="section-number-3">1.3</span> Rational Numbers</h3>
<div class="outline-text-3" id="text-h-95b8e0bc-d3f5-4e9e-9789-f168e8e54ea2">
<p>
The intuitive construction of the rational numbers is any pair of
integers \(a/b\) where \(b\neq0\) is nonzero. Addition is defined as
</p>

\begin{equation}
\frac{a}{b} + \frac{x}{y} = \frac{ay + bx}{by}
\end{equation}

<p>
Multiplication is defined as
</p>

\begin{equation}
\frac{a}{b}\times\frac{x}{y} = \frac{a\times x}{b\times y}.
\end{equation}

<p>
We could go through another Grothendieck construction to derive the
rational numbers formally from the integers, but that's tedious.
</p>
</div>
</div>

<div id="outline-container-h-fff97fc0-1878-49ee-9040-36ab02b2f9a3" class="outline-3">
<h3 id="h-fff97fc0-1878-49ee-9040-36ab02b2f9a3"><span class="section-number-3">1.4</span> Real Numbers</h3>
<div class="outline-text-3" id="text-h-fff97fc0-1878-49ee-9040-36ab02b2f9a3">
<p>
There are a variety of ways to construct the real numbers, at least
three I'm aware of:
</p>

<ol class="org-ol">
<li>using Dedekind cuts,</li>
<li>Bourbaki's topological closure of the rationals</li>
<li>as the smallest ordered field containing the rationals</li>
</ol>

<p>
The latter seems the most direct way to get cooking.
</p>
</div>

<div id="outline-container-h-69e02083-6b6c-4e65-a429-3ac76ee71a8d" class="outline-4">
<h4 id="h-69e02083-6b6c-4e65-a429-3ac76ee71a8d"><span class="section-number-4">1.4.1</span> Axioms</h4>
<div class="outline-text-4" id="text-h-69e02083-6b6c-4e65-a429-3ac76ee71a8d">
<ol class="org-ol">
<li>\((\mathbb{R}, +, \times)\) form a field
<ul class="org-ul">
<li>Associativity of multiplication and addition: for any
\(x,y,z\in\mathbb{R}\) we have \((x + y) + z = x + (y + z)\) and
\((x\times y)\times z = x\times(y\times z)\)</li>
<li>Commutativity of addition and multiplication: for any
\(x,y\in\mathbb{R}\) we have \(x + y = y + x\) and
\(x\times y=y\times x\)</li>
<li>Distributivity: for any \(x,y,z\in\mathbb{R}\) we have
\(x\times(y + z) = (x\times y) + (x\times z)\)</li>
<li>For any \(x\in\mathbb{R}\), \(x + 0 = x\)</li>
<li>0 is not equal to 1, and for any \(x\in\mathbb{R}\) we have \(x\times1=x\)</li>
<li>For any \(x\in\mathbb{R}\) there exists a unique
\(-x\in\mathbb{R}\) such that \(x+(-x)=0\)</li>
<li>For any nonzero \(x\in\mathbb{R}\) there exists a unique
\(x^{-1}\in\mathbb{R}\) such that \(x\times x^{-1}=1\)</li>
</ul></li>
<li>\((\mathbb{R}, \leq)\) form a totally ordered set
<dl class="org-dl">
<dt>Reflexivity</dt><dd>For any \(x\in\mathbb{R}\), we have \(x\leq x\)</dd>
<dt>Antisymmetry</dt><dd>For any \(x,y\in\mathbb{R}\), if \(x\leq y\) and \(y\leq x\), then
\(x = y\)</dd>
<dt>Transitivity</dt><dd>For any \(x,y,z\in\mathbb{R}\), if \(x\leq y\) and \(y\leq z\), then
\(x\leq z\)</dd>
<dt>Totality</dt><dd>For all \(x,y\in\mathbb{R}\), either \(x\leq y\) or \(y\leq x\).</dd>
</dl></li>
<li>The field operations \(+\) and \(\times\) are compatible with the
order \(\leq\) on \(\mathbb{R}\), in particular
<ul class="org-ul">
<li>If \(x,y\in\mathbb{R}\) are such that \(x\leq y\), then for any
\(z\in\mathbb{R}\) we have \(x+z\leq y+z\).</li>
<li>For any \(x,y\in\mathbb{R}\), if \(0\leq x\) and \(0\leq y\), then
\(0\leq x\times y\)</li>
</ul></li>
<li>The order \(\leq\) is complete (i.e., every non-empty subset of
\(\mathbb{R}\) bounded above has a least upper bound)</li>
</ol>

<p>
Tarski provided another axiomatization in 1936 with four undefined
notions. Again, we don't need it for our purposes.
</p>
</div>
</div>
</div>

<div id="outline-container-h-4fed6c46-045e-47d5-a733-af8ad46ca34e" class="outline-3">
<h3 id="h-4fed6c46-045e-47d5-a733-af8ad46ca34e"><span class="section-number-3">1.5</span> Transcendental and Algebraic Numbers</h3>
<div class="outline-text-3" id="text-h-4fed6c46-045e-47d5-a733-af8ad46ca34e">
<div class="definition" id="org3db067a">
<p>
We call a number \(a\) <dfn>Algebraic</dfn> if there exists some
polynomial \(p(x)\) for which \(a\) is a root, \(p(a) = 0\).
</p>

</div>

<p>
Observe: any rational number is algebraic, since \(p(x) = x - r\) for
\(r\in\QQ\) is such a polynomial.
</p>

<div class="theorem" id="orgc246dec">
<p>
The set of algebraic numbers is countable.
</p>

</div>

<div class="definition" id="orgf9feb29">
<p>
We call a number \(t\) <dfn>Transcendental</dfn> if it is not algebraic.
</p>

</div>

<div class="theorem" id="orgdc13d9e">
<p>
(Gelfond&#x2013;Schneider)
If \(a\) and \(b\) are algebraic numbers, \(a\neq 0\) and \(a\neq 1\), with \(b\)
irrational, then any value of \(a^{b}\) is a transcendental number.
</p>

</div>

<p>
As a consequence, almost all real numbers are transcendental. Most of
them are not really even "used" in practice.
</p>
</div>
</div>

<div id="outline-container-h-842c7308-3999-4bb3-9c26-f77e07103242" class="outline-3">
<h3 id="h-842c7308-3999-4bb3-9c26-f77e07103242"><span class="section-number-3">1.6</span> Definable Real Numbers</h3>
<div class="outline-text-3" id="text-h-842c7308-3999-4bb3-9c26-f77e07103242">
<div class="definition" id="orgabbe193">
<p>
We say a real number \(a\) is <dfn>Definable in the Language of Arithmetic</dfn>
if its Dedekind cut can be defined as a predicate in that language;
i.e., if there is a first-order formula \(\varphi\) in the language of
arithmetic, with three variables, such that
</p>

\begin{equation}
\forall m,\forall n,\forall p\left(\varphi(m,n,p)\iff\frac{(-1)^{p}m}{n}\lt a\right).
\end{equation}

</div>

<p>
Our intuition is that \(m\), \(n\), and \(p\) range over all natural numbers.
The only operations allowed in Peano arithmetic are addition and
multiplication. (And, I suppose, the successor operation, which is just
"addition with 1" intuitively.) The only constants allowed in Peano
arithmetic are 0 and 1.
</p>

<p>
An equivalent way to characterize arithmetically definable real numbers
is by considering Dedekind cuts of the form
</p>

\begin{equation}
\{m/n \mid \forall x_{1}\exists x_{2}\dots \forall x_{k-1}\exists x_{k},p(m,n,\vec{x})=0\}
\end{equation}

<p>
for some fixed polynomial with integer coefficients \(p\), and the \(x\)'s
range over integers. Here both \(\E\) and \(\pi\) are definable, as are all
our favorite real numbers. A standard reference for this line of
thinking is:
</p>

<ul class="org-ul">
<li>Reference: Simpson's <cite class="book-title">Subsystems of Second-Order Arithmetic</cite>
discusses system \(ACA_{0}\), which we've basically defined.</li>
</ul>

<p>
It is invalid to reason, "Well, we can define \(\pi\) as the area of the
unit circle, and that's a formula, so it is definable." (Or worse, "We
<i>define</i> \(\pi\) as&#x2026;, therefore since it's <i>defined</i> that way it must be
<i>definable</i>.") Please don't do this.
</p>

<div class="puzzle" id="orgb9b3369">
<p>
We can consider <a href="https://en.wikipedia.org/wiki/Definable_real_number">definable real numbers</a>, is the intersection of
transcendental numbers with definable real numbers interesting in some
way?
</p>

</div>
</div>
</div>
</div>

<div id="outline-container-h-388452a6-a114-401d-b69d-8f42e86dba55" class="outline-2">
<h2 id="h-388452a6-a114-401d-b69d-8f42e86dba55"><span class="section-number-2">2</span> Scientific Notation</h2>
<div class="outline-text-2" id="text-h-388452a6-a114-401d-b69d-8f42e86dba55">
<p>
We can represent any real number using three components:
</p>

<ol class="org-ol">
<li>Its sign (+1 or -1)</li>
<li>Its magnitude (an integer)</li>
<li>Its mantissa (a real number less than the base)</li>
</ol>

<p>
In base 10, we would write \(x = s\times m\times 10^{p}\) where
\(s\in\{+1,-1\}\), \(0\lt m\lt 10\), and \(p\in\mathbb{Z}\). Every real
number may be written in this manner, and it is called "scientific
notation".
</p>

<p>
The difficulty is, not every real number may be represented with
finitely many digits. For example \(\pi\) requires infinitely many,
as does \(\sqrt{2}\). We then form <i>approximations</i> to these
numbers. Since this is an approximation, we are left with errors,
which propagate in our calculations. The entire field of
<a href="../comp-sci/numerical-analysis.html">Numerical Analysis</a> studies this matter.
</p>
</div>

<div id="outline-container-h-1cc9f972-bff9-490f-b31b-3c66c9cdf012" class="outline-3">
<h3 id="h-1cc9f972-bff9-490f-b31b-3c66c9cdf012"><span class="section-number-3">2.1</span> Binary</h3>
<div class="outline-text-3" id="text-h-1cc9f972-bff9-490f-b31b-3c66c9cdf012">
<p>
When we work in base 2, the mantissa is a sequence of bits with
leading bit being 1 (otherwise we could shift the mantissa down
until it is 1, and the exponent decreases by the number of
shifts). This has the advantage that \(1\lt m\lt 2\), which can speed
up Taylor series computations.
</p>

<p>
For example, the logarithm of \(x\) in this notation is given by
</p>

\begin{equation}
\log(x) = \log(s) + \log(m) + p\log(2)
\end{equation}

<p>
which consists of looking up stored values for \(\log(2)\), and
computing a series approximation for \(\log(m)\).
</p>

<p>
We can extract the components for a float in Common Lisp by
</p>

<pre class="example" id="orgfc530b5">
USER =&gt; (multiple-value-bind (mantissa expon sign)
(decode-float f)
  (scale-float mantissa expon))
;; equivalent to (abs f)

USER&gt; (multiple-value-bind (mantissa expon sign)
          (decode-float pi)
        (list :sign sign :mantissa mantissa :exponent expon))
;; (:SIGN 1.0d0 :MANTISSA 0.7853981633974483d0 :EXPONENT 2)
</pre>
</div>
</div>
</div>

<div id="outline-container-h-fbae1e82-b1d1-46f5-8e08-4d1d6f7774d2" class="outline-2">
<h2 id="h-fbae1e82-b1d1-46f5-8e08-4d1d6f7774d2"><span class="section-number-2">3</span> References</h2>
<div class="outline-text-2" id="text-h-fbae1e82-b1d1-46f5-8e08-4d1d6f7774d2">
<p>
-Every real analysis textbook</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="postamble">Last Updated 2021-04-11 Sun 11:58.</p>
</div>
</body>
</html>